In [1]:
# https://docs.mongodb.com/manual/reference/operator/query/

'''
1. All the companies that it's name match 'Babelgum'. Retrieve only their name field.
2. All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by number of employees.
3. All the companies founded between 2000 and 2005, both years included. Retrieve only the name and founded_yearfileds.
4. All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the name and ipo fields.
5. All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.
6. All the companies that don't include the partners field.
7. All the companies that have a null type of value on the category_code field.
8. All the companies that have at least 100 employees but less than 1000. Retrieve only the name and number of employees fields.
9. Order all the companies by their IPO price descendently.
10. Retrieve the 10 companies with more employees, order by the number of employees
11. All the companies founded on the second semester of the year. Limit your search to 1000 companies.
12. All the companies that have been 'deadpooled' after the third year.
13. All the companies founded before 2000 that have and acquisition amount of more than 10.000.000
14. All the companies that have been acquired after 2015, order by the acquisition amount, and retrieve only their nameand acquisiton field.
15. Order the companies by their founded year, retrieving only their name and founded year.
16. All the companies that have been founded on the first seven days of the month, including the seventh. Sort them by their aquisition price descendently. Limit the search to 10 documents.
17. All the companies on the 'web' category that have more than 4000 employees. Sort them by the amount of employees in ascendant order.
18. All the companies which their acquisition amount is more than 10.000.000, and currency are 'EUR'.
19. All the companies that have been acquired on the first trimester of the year. Limit the search to 10 companies, and retrieve only their name and acquisition fields.
20. All the companies that have been founded between 2000 and 2010, but have not been acquired before 2011.


from pymongo import MongoClient 
client = MongoClient("mongodb://admin:admin@localhost:32768")
db = client.mybbdd
docs = db.docs.find({"founded_year":{"$gte":2010}})
print(len(list(docs)))

'''
pass

In [2]:
# https://docs.mongodb.com/manual/reference/operator/query/
from pymongo import MongoClient
import pymongo
import pandas as pd
from pandas.io.json import json_normalize

In [3]:
client = MongoClient("mongodb://admin:admin@localhost:32768")
db = client.mybbdd

In [4]:
# docs = db.docs.find({"founded_year":{"$gte":2010}})
# print(len(list(docs)))

1. All the companies that it's name match 'Babelgum'. Retrieve only their name field.

In [5]:
# name
companies1 = db.docs.find({"name":{"$eq":"Babelgum"}}, { "name": 1 , "_id": 0})
df1 = pd.DataFrame(list(companies1))
df1.head()

       name
0  Babelgum

2. All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by number of employees.

In [6]:
# number_of_employees
companies2 = db.docs.find({"number_of_employees":{"$gt":5000}}, 
                          limit=20, 
                          projection={ "name": 1 , "number_of_employees": 1, "_id": 0}).sort('number_of_employees' , pymongo.DESCENDING)
df2 = pd.DataFrame(list(companies2))
print(len(df2))
df2

20

                                          name  number_of_employees
0                                      Siemens               405000
1                                          IBM               388000
2                                       Toyota               320000
3                                       PayPal               300000
4   Nippon Telegraph and Telephone Corporation               227000
5                          Samsung Electronics               221726
6                                    Accenture               205000
7                    Tata Consultancy Services               200300
8                    Flextronics International               200000
9                                      Safeway               186000
10                                        Sony               180500
11                                          LG               177000
12                                        Ford               171000
13                                      Boeing               160000
14               Digital Equipment Corporation               140000
15                                       Nokia               125000
16                         MItsubishi Electric               107000
17                         MItsubishi Electric               107000
18                                     Comcast               100000
19                                 Bertelsmann               100000

3. All the companies founded between 2000 and 2005, both years included. Retrieve only the name and founded_yearfileds.

In [7]:
# founded_year
companies3 = db.docs.find({"founded_year":{"$gte":2000, "$lte":2005}}, 
                          projection={"name": 1 , "founded_year": 1, "_id": 0})

d = list(companies3)
df3 = pd.DataFrame(d)
print(len(df3))
df3.head(10)

3734

   founded_year         name
0          2005         Zoho
1          2004         Digg
2          2005    Omnidrive
3          2005     Wetpaint
4          2002  StumbleUpon
5          2003       Gizmoz
6          2005        Helio
7          2004     Facebook
8          2002        Plaxo
9          2002   Technorati

4. All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the name and ipo fields.

In [20]:
# Valuation Amount
# hay que buscar ipo en compass
companies4 = db.docs.find({"founded_year":{"$lt":2010}, "ipo.valuation_amount": {"$gte": 100000000}}, 
                          projection={"name": 1 , "ipo.valuation_amount": 1, "_id": 0})

# json_normalize(companies4)
# json_normalize(companies4)
d = list(companies4)

# pd4 = json_normalize((list(doc4)))

df4 = pd.DataFrame(d)
# print(len(df4))
df4.head(10)

                                  ipo            name
0  {'valuation_amount': 104000000000}        Facebook
1   {'valuation_amount': 18100000000}         Twitter
2    {'valuation_amount': 1300000000}            Yelp
3    {'valuation_amount': 9310000000}        LinkedIn
4     {'valuation_amount': 290000000}      Brightcove
5  {'valuation_amount': 100000000000}          Amazon
6     {'valuation_amount': 235000000}     KIT digital
7    {'valuation_amount': 1600000000}         Nielsen
8    {'valuation_amount': 1050000000}       OpenTable
9     {'valuation_amount': 287000000}  ChannelAdvisor

5. All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.

In [9]:
# number_of_employees
companies5 = db.docs.find({"number_of_employees":{"$lt":1000}, "founded_year": {"$lt": 2005}}, 
                          limit=10, 
                          projection={"name": 1 , "number_of_employees": 1, "_id": 0}).sort('number_of_employees' , pymongo.DESCENDING)

d = list(companies5)
df5 = pd.DataFrame(d)
df5

                              name  number_of_employees
0             Infinera Corporation                  974
1  NorthPoint Communications Group                  948
2                     888 Holdings                  931
3               Forrester Research                  903
4                        SonicWALL                  900
5                       Webmetrics                  900
6             Cornerstone OnDemand                  881
7                             Yelp                  800
8                         ZoomInfo                  800
9                          MySpace                  800

6. All the companies that don't include the partners field.

In [10]:
# not partners field
companies6 = db.docs.find({"partners":{"$exists":False}}, 
                          # limit=10, 
                          projection={"name": 1, "_id": 0})

d = companies6
# df6 = pd.DataFrame(d)
# df6
print(len(list(d)))

# Todos tienen campo partners

0

7. All the companies that have a null type of value on the category_code field.

In [11]:
# not category_code field
companies7 = db.docs.find({"category_code":{"$exists":False}}, 
                          # limit=10, 
                          projection={"name": 1, "_id": 0})

d = companies7
# df7 = pd.DataFrame(d)
# df7
print(len(list(d)))

0

8. All the companies that have at least 100 employees but less than 1000. Retrieve only the name and number of employees fields.

In [12]:
# not category_code field
companies8 = db.docs.find({"number_of_employees":{"$gt":100, "$lt": 1000}}, 
                          # limit=10, 
                          projection={"name": 1, "number_of_employees": 1, "_id": 0})

# df7 = pd.DataFrame(d)
# df7
d = list(companies8)
print(len(d))
df8 = pd.DataFrame(d)
df8.head()

753

        name  number_of_employees
0  AdventNet                  600
1    AddThis                  120
2      OpenX                  305
3   LifeLock                  644
4      Jajah                  110

9. Order all the companies by their IPO price descendently.

In [13]:
### no sale


companies9 = db.docs.find( projection={"name": 1, "_id": 0}).sort('IPO', pymongo.DESCENDING)

# df7 = pd.DataFrame(d)
# df7
d = list(companies9)
print(len(d))
df9 = pd.DataFrame(d)
df9.head()

OperationFailure: Executor error during find command :: caused by :: Sort operation used more than the maximum 33554432 bytes of RAM. Add an index, or specify a smaller limit.

10. Retrieve the 10 companies with more employees, order by the number of employees

In [ ]:
# number_of_employees
companies10 = db.docs.find( 
                          limit=10, 
                          projection={"name": 1, "number_of_employees": 1, "_id": 0}).sort('number_of_employees' , pymongo.DESCENDING)

d = list(companies10)
df10 = pd.DataFrame(d)
df10

11. All the companies founded on the second semester of the year. Limit your search to 1000 companies.

In [ ]:
# number_of_employees
companies11 = db.docs.find( {"semester": {"$in": [7, 8, 9, 10, 11, 12]}"}
                          limit=1000, 
                          projection={"name": 1, "_id": 0})

d = list(companies11)
df11 = pd.DataFrame(d)
df11

12. All the companies that have been 'deadpooled' after the third year.

13. All the companies founded before 2000 that have and acquisition amount of more than 10.000.000

14. All the companies that have been acquired after 2015, order by the acquisition amount, and retrieve only their nameand acquisiton field.

15. Order the companies by their founded year, retrieving only their name and founded year.

16. All the companies that have been founded on the first seven days of the month, including the seventh. Sort them by their aquisition price descendently. Limit the search to 10 documents.

17. All the companies on the 'web' category that have more than 4000 employees. Sort them by the amount of employees in ascendant order.

18. All the companies which their acquisition amount is more than 10.000.000, and currency are 'EUR'.

19. All the companies that have been acquired on the first trimester of the year. Limit the search to 10 companies, and retrieve only their name and acquisition fields.

20. All the companies that have been founded between 2000 and 2010, but have not been acquired before 2011.